Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/kompetansenorge.no.csv-en-nn.deduped.tmx
Source language: en
Languages: nn

source: • give examples of diversity in Norway, with an emphasis on different family
nn: • gi eksempel på mangfald i Noreg med vekt på ulike familieformer, levesett,

source: • According to Norwegian law, what Hans did to Marit was rape.
nn: • Etter norsk lov er det Hans gjer med Marit, ei valdtekt.

source: • order goods and fill in order forms
nn: Av og til vil barnehageassistenten

source: The competence aims in this curriculum describe the objectives of the training in oral, listening, reading and writing skills in Norwegian.
nn: Kompetansemåla i denne læreplanen beskriv mål for opplæringa innan språkferdigheitene munnleg, lytte, lese og skrive.

source: Learners can write clear, well-structured and detailed texts, and master different sentence patterns and connectors.
nn: Innlæraren kan skrive klare, velstrukturerte og detaljerte tekstar og meistrar ulike setningsmønster og samanbindande markørar.

source: through sexual contact, for example:
nn: som smittar gjennom seksuelt samvær, for

source: It can also entail talking about something that has happened at work, translating and explaining a menu in different languages and cultures, or taking notes during a presentation for own or group use.
nn: Det kan også vere å fortelje om noko som har skjedd på jobb, omsette og forklare ein meny på tvers av språk og kultur eller å ta notat frå ein presentasjon til bruk i eige eller felles arbeid.

source: backgrounds are also exposed to forced marriage.
nn: minoritetsbakgrunn er også utsette for tvangsekteskap.

source: Involuntary sexual activity is rape and is punishable by imprisonment for up to 10 years.
nn: Ufrivillig seksuell omgang er det same som valdtekt og kan straffast med fengsel i inntil 10 år.

source: • employ different reading strategies to understand the main features of a
nn: • bruke ulike lesestrategiar for å oppfatte hovudtrekk i ein tekst på den

source: • document the work performed
nn: • få instruksjonar og diskutere arbeidet med eigarar

source: • Many married couples divorce and many
nn: • Mange ektepar skil seg, og mange sambuarar

source: • develop an argument in a text, giving reasons for or against a specific point
nn: • skrive tekstar der ein utviklar eit argument, gir grunnar for eller imot eit

source: informative texts, e.g. short official letters and documents, websites and brochures;
nn: informative tekstar, for eksempel korte offentlege brev og dokument, nettsider og brosjyrar

source: About the curriculum for level C1 The curriculum for level C1 contains a description of global goals, specific goals and characteristics of the language use.
nn: Om læreplanen for nivå C1 Læreplanen for nivå C1 beskriv globale mål, delmål og kjenneteikn ved språket i bruk.

source: • The Marriage Act also applies to marriages entered into outside Norway.
nn: • Ekteskapslova gjeld også for ekteskap som blir inngått i utlandet.

source: The objective of the training is for participants to be able to use very simple phrases and sentences to talk about themselves and matters relating to their lives.
nn: Mål for opplæringa er at deltakaren skal kunne bruke svært enkle frasar og setningar for å snakke om seg sjølv og nære forhold.

source: A change from summative to formative assessment practice (Black and Wiliam 1998) requires changes in the teacher’s behaviour and way of thinking.
nn: Ei endring frå summativ til formativ vurderingspraksis (Black og Wiliam 1998) krev endringar i åtferd og tankesett hos læraren.

source: • employ strategies to compensate for vocabulary deficits, for example by
nn: • bruke strategiar for å kompensere for manglar i ordforrådet, for eksempel

source: • write reports and minutes related to their own occupation and areas of
nn: • skrive rapportar og referat knytte til eige fag- og interessefelt

source: • write simple coherent texts containing some detailed descriptions about
nn: • skrive enkle samanhengande tekstar om erfaringar, opplevingar,

source: Memona is only 19 years old and wants to
nn: Memona er berre 19 år, ho ønsker å ta utdanning og synest sjølv

source: The recommended minimum levels of Norwegian for different groups of participants are specified in section 28 of the Integration Regulations.
nn: Rettleiande minimumsnivå i norsk for ulike grupper deltakarar er fastsette i integreringsforskrifta § 28.

source: How have I learned it?
nn: Korleis har eg lært det?

source: Participants should be able to take part in very simple, familiar spoken interaction in everyday life when the conversation partner speaks slowly and clearly and is supportive.
nn: Deltakaren skal kunne delta i svært enkle, kjende munnlege samhandlingssituasjonar i dagleglivet når samtalepartnaren snakkar langsamt og tydeleg og er støttande.

source: Participants must therefore feel confident and understand that all language learning begins at level 1, and that trial and error are a natural part of the process.
nn: Deltakarane må difor kunna kjenna seg trygge på og forstå at all språklæring startar på nivå 1, og at prøving og feiling er ein naturleg del av prosessen.

source: • discuss how work, income and consumption can affect personal finances,
nn: • samtale om korleis arbeid, inntekt og forbruk kan påverke personleg

source: • recognise familiar names, familiar words and very simple phrases in simple
nn: • kjenne att kjende namn, kjende ord og svært enkle frasar i enkle autentiske

source: The training will improve participants’ digital judgement and strategies for internet use and to evaluate and use different digital tools to support communication and learning Norwegian.
nn: Opplæringa skal bidra til å styrke den digitale dømmekrafta og strategiane for nettbruk og til å vurdere og bruke ulike digitale verktøy som støtte i kommunikasjon og læring av norsk.

source: • understand a wide range of auditory material, for example, podcasts or films,
nn: • kan forstå eit breitt spekter av auditivt materiale, for eksempel podkast eller

source: Participants must develop Norwegian language skills that allow them to remain informed about relevant topics associated with social, economic, geographical and environmental circumstances in society and to participate in conversations and discussions about these topics.
nn: Deltakarane skal utvikle norskferdigheiter som gjer det mogleg å halde seg informert om relevante tema knytte til sosiale, økonomiske, geografiske og miljømessige forhold i samfunnet og delta i samtalar og diskusjonar om desse temaa.

source: of view, and discuss the pros and cons of different alternatives;
nn: bestemt synspunkt og drøftar fordelane og ulempene ved ulike alternativ

source: • spontaneously discuss many different topics as part of a flowing
nn: • samtale om mange ulike tema med spontanitet og flyt og tilpasse språket til

source: Basic skills Norwegian language training for adult immigrants will support and facilitate the use and further development of participants’ digital and oral communication skills and their basic skills in reading, writing and arithmetic.
nn: Opplæring i norsk for vaksne innvandrarar skal støtte og legge til rette for at deltakarane får bruke og utvikle vidare både digitale og munnlege ferdigheiter og grunnleggande ferdigheiter i lesing, skriving og rekning.

source: The learner has an extensive vocabulary, allowing them to express themself idiomatically and more or less effortlessly in most contexts.
nn: Innlæraren har eit stort nok ordforråd til å uttrykke seg idiomatisk og på ein tilnærma uanstrengd måte i dei fleste samanhengar.

source: A sleeping person cannot consent to sex
nn: Den som søv, kan ikkje samtykke til sex

source: Lisa and Anna have been in a relationship for two years and want to live together.
nn: Lisa og Anna har vore kjærastar i to år og skal bli sambuarar.

source: transitions between the arguments are clearly indicated;
nn: overgangane mellom argumenta er tydeleg markerte

source: • Complicity in a forced marriage is punishable in the same way.
nn: • Medverknad til tvangsekteskap blir straffa på same måte.

source: In adult classes, attention to the participants’ goal orientation can help the teacher improve the efficiency of the teaching and give the participants qualitative long-term learning.
nn: I vaksenklassar kan merksemd om kva målorientering deltakarane har, hjelpa læraren til å effektivisera læringsinnsatsen og gi deltakarane høve til kvalitativ langtidslæring.

source: The organisation should therefore be based on what participants have in common, so that they can take advantage of this in the training.
nn: Organiseringa bør derfor bygge på kva deltakarane har til felles, slik at ein kan dra vekslar på dette i opplæringa.

source: • Talk about Memona’s situation.
nn: • Snakk saman om situasjonen til Memona.

source: to contact your test centre.
nn: må du kontakte prøvestaden din.

source: : Hi, are you Lisa?
nn: Hei, er det du som er Lisa?

source: • edit, summarise and accurately convey the main content of complex texts
nn: • bearbeide, samanfatte og formidle vidare på ein påliteleg måte

source: • express their opinions on topics of personal interest in simple terms;
nn: • uttrykke eigne meiningar om emne av personleg interesse på ein enkel måte

source: For an individual to develop language, the participant must be active and construct their own learning, regardless of their educational background.
nn: For at språkutvikling skal skje i det enkelte individet, må deltakaren sjølv vera aktiv og konstruera si eiga læring, uansett utdanningsbakgrunn.

source: At level B1, participants can understand clear and relatively simple language, and can express themselves in a comprehensible and coherent manner on topics related to their life and learning and work situations, topical issues and issues of personal interest.
nn: På nivå B1 kan deltakaren forstå klart og relativt enkelt språk og uttrykke seg forståeleg og samanhengande om emne knytte til eigen livs-, opplærings- og arbeidssituasjon, kjende samfunnsaktuelle tema og tema av personleg interesse.

source: • understand very simple notifications, messages, instructions and directions
nn: • forstå heilt enkle meldingar, beskjedar, instruksjonar og tilvisingar til stad

source: The objective of the training is for participants to be able to express themselves in a clear and comprehensible manner on most general topics and topics related to their occupation and areas of interest.
nn: skrivinga Mål for opplæringa er at deltakaren skal kunne uttrykke seg klart og lett forståeleg om dei fleste allmenne emne og emne knytte til eige fag- og interessefelt.

source: • understand specific details in notifications, messages, instructions and
nn: • forstå spesifikke detaljar i meldingar, beskjedar, instruksjonar og tilvisingar

source: Forced marriage is against the law
nn: Tvangsekteskap er forbode

source: • Forced marriages are not valid under Norwegian law and may be
nn: • Tvangsekteskap er ugyldige etter norsk lov og kan oppløysast.

source: Participants will progress from being able to communicate in personal and everyday situations at levels A1 and A2 to being able to communicate about more abstract and general issues at levels B1 and B2.
nn: Utviklinga går frå å kunne kommunisere i personlege og daglegdagse situasjonar på nivå A1 og A2 til å kunne kommunisere om meir abstrakte og generelle problemstillingar på nivå B1 og B2.

source: If you have any questions about the date of your test, contact your test centre.
nn: Dersom du har spørsmål om datoen for prøven, må du kontakte prøvestaden.

source: The curriculum for level C1 is therefore structured in accordance with the reception, production, interaction and mediation modes.
nn: Læreplanen for nivå C1 er derfor strukturert etter kommunikasjonskategoriane resepsjon, produksjon, samhandling og mediering.

source: many children to have, and when to have them.
nn: mange barn ein vil ha, og når dette skal skje.

source: Participants must experience achievement in order to be motivated to try to learn.
nn: Deltakarane må oppleva meistring for å bli motiverte til læringsinnsats.

source: Learners have no difficulty following and contributing to the interaction in formal and informal discussions and conversations, also when the topics are complex and/or unfamiliar.
nn: Innlæraren kan lett følge og bidra til samhandling i formelle og uformelle diskusjonar og samtalar, også når det dreier seg om komplekse og/eller ukjende emne.

source: • read work drawings, orders and plans
nn: • lese skilt og instruksar i trafikken

source: The objective of the training is for participants to be able to read and understand short, simple texts about familiar topics related to themselves and their surroundings, their learning and work situations, and society.
nn: Mål for opplæringa er at deltakaren skal kunne lese og forstå korte, enkle tekstar om kjende emne knytte til eigen person, nære omgivnader, opplæring og arbeids- og samfunnsliv.

source: They have applied for separation, and Patrick has moved into a flat not far from Maria.
nn: Dei har søkt om separasjon, og Patrick har flytta til ei leilegheit ikkje så langt frå Maria.

source: very simple diagrams and tables;
nn: enkle diagram og tabellar

source: • answer simple questions about themselves in an interview situation;
nn: • svare på enkle spørsmål om seg sjølv i ein intervjusituasjon

source: The penalty for forced marriage
nn: Strafferamme for tvangsekteskap

source: authentic informative texts, particularly if these are supported by illustrations;
nn: autentiske informative tekstar, spesielt dersom det er støtte i illustrasjonar

source: • read and understand very simple, adapted informative and fiction texts,
nn: • lese og forstå svært enkle, tilrettelagde informative og skjønnlitterære

source: Reading and writing goals and processes
nn: Lese- og skriveførebuande mål og prosessar

source: • log technical problems and discrepancies
nn: • lese og setje seg inn i nye rutinar

source: Together they shape and create a context in the work with the competence goals across language skills and levels.
nn: Til saman skal dei gi retning og skape samanheng i arbeidet med kompetansemåla på tvers av språkferdigheiter og nivå.

source: Your result may be affected by a number of factors, such as stress, ability to concentrate, misinterpretation or other disruptions.
nn: Fleire ulike faktorar kan påverke resultatet ditt, til dømes stress, konsentrasjonsevne, mistydingar eller andre distraksjonar.

source: Scope The competence goals are divided into three modules, each of which have a scope of 25 hours.
nn: Timetal Kompetansemåla er delte inn i tre modular, som kvar har eit timeomfang på 25 timar.

source: • write in simple terms about their background, experiences, interests and
nn: • skrive enkelt om eigen bakgrunn, opplevingar, interesser og framtidsplanar

source: Do you need a new test certificate?
nn: Treng du eit nytt prøvebevis?

source: Are you applying for higher education?
nn: Søkjer du opptak til høgare utdanning?

source: • summarise and convey relevant information from clearly formulated texts on
nn: • samanfatte og formidle vidare relevant informasjon frå klart formulerte

source: The deadline for appealing the result of the Test in Norwegian C1 – higher academic level, summer, is closed, the periode was from 22.
nn: Fristen for å klage på resultat på Norskprøven C1 – høgare akademisk nivå er stengd, perioden var frå 22.

source: child welfare service can support families;
nn: og barnevern, kan støtte familiar

source: • write notes and memos to themselves and others
nn: • sjekke budsjett og kome med innspel i forhold drift

source: • read and understand complex texts that contain illustrations, such as
nn: • lese og forstå samansette tekstar som inneheld grafiske framstillingar, for

source: • write and read familiar words and simple sentences with support, for
nn: • skrive og lese kjende ord og enkle setningar med støtte, for eksempel ved

source: In the training, arithmetic work must be based on participants' needs for functional calculation skills in Norwegian, and must be adapted to their capacity for learning and needs, and the demands and challenges they face in their surroundings.
nn: Arbeid med rekning i opplæringa skal ta utgangspunkt i kva behov deltakarane har for funksjonelle ferdigheiter i rekning på norsk, og må tilpassast dei føresetnadene og behova dei har, i tillegg til krav og utfordringar dei møter i omgivnadene sine.

source: • summarise and accurately convey the main content of complex information
nn: • samanfatte og formidle vidare på ein påliteleg måte hovudinnhaldet i

source: The learner has a wide repertoire of grammatical structures and can express and understand nuances and details.
nn: Innlæraren har eit breitt repertoar av grammatiske strukturar og kan uttrykke og forstå nyansar og detaljar.

source: • read and understand clear and straightforward instructions;
nn: • lese og forstå klare og greie instruksjonar

source: • employ very simple listening strategies, such as deriving the meaning of
nn: • bruke nokre svært enkle lyttestrategiar, som å utleie betydninga av

source: • Is this rape?
nn: • Er dette valdtekt?

source: • read information about new procedures
nn: • rapportere og dokumentere hærverk og tjuveri

source: Numeracy In Norwegian language training for adult immigrants, arithmetic skills involve acquiring and communicating mathematical information in everyday life and using arithmetic in familiar and unfamiliar situations when necessary in Norwegian.
nn: Å kunne rekne i faget norsk for vaksne innvandrarar inneber å tileigne seg og kommunisere om matematisk informasjon i kvardagen og å ta i bruk rekning i kjende og ukjende samanhengar når dette skjer på norsk.

source: In 1986, Norway elected the first government
nn: I 1986 fekk Noreg den første regjeringa som bestod

source: • employ simple reading strategies, such as deriving the meaning of specific,
nn: • bruke nokre enkle lesestrategiar, som å utleie betydninga av konkrete,

source: • Providing for and raising children is the responsibility of the parents.
nn: • Omsorg for og oppseding av barn er foreldra sitt ansvar.

source: Lisa says that she remembers nothing and starts to cry.
nn: Lisa seier at ho ikkje hugsar noko, og begynner å gråte.

source: • Women and men have the same right to freely choose their spouses.
nn: • Kvinner og menn har same rett til fritt å velje ektefelle.

source: • answer simple, direct questions about themselves in very simple terms in an
nn: • svare på enkle, direkte spørsmål om seg sjølv på ein svært enkel måte i ein

source: – payments from NAV or your employer when you are ill.
nn: – utbetaling frå NAV eller arbeidsgjevaren når ein blir sjuk

source: • In many cases, the victim is too intoxicated
nn: • I mange tilfelle er offeret for påverka

source: Are you unable to take the test?
nn: Kan du ikkje ta prøven?

source: • describe experiences, events and expectations in a nuanced and precise
nn: • beskrive erfaringar, hendingar og forventningar på ein nyansert og presis

source: • put forward their own arguments in discussions and meetings within their
nn: • argumentere for eigne synspunkt i diskusjonar og møte innan eige fag- og

source: This means being able to use the Norwegian language to create meaning, interact with others, express points of view and ideas, and participate actively in the local community, at work and in education/training.
nn: Det inneber å kunne bruke norsk språk til å skape meining, samhandle med andre, uttrykke synspunkt og idear og medverke aktivt i lokalsamfunn, jobb og utdanning/opplæring.

source: • write using adapted software and apps;
nn: • skrive ved bruk av tilpassa dataprogram og appar

source: • write and edit clear and detailed texts adapted to the situation and purpose;
nn: • skrive og bearbeide klare og detaljerte tekstar tilpassa situasjon og formål

source: At a higher level, it can also mean communicating the main content of complex texts and commenting on other people’s input during a discussion.
nn: På høgare nivå kan det også vere å formidle vidare hovudinnhaldet i komplekse tekstar og å kommentere innspel frå andre i ein diskusjon.

source: • convey very simple information about time and place;
nn: • formidle vidare svært enkel informasjon om tid og stad

source: • Performing or being complicit in female
nn: • Det er forbode å utføre eller

source: to training, education and work;
nn: opplæring, utdanning og arbeid

source: people aged under 16 is a criminal offence.
nn: barn og unge under 16 år er straffbart.

source: • read and understand short, simple instructions, particularly those that are
nn: • lese og forstå korte instruksjonar som er enkelt formulerte og gjerne

source: Learners understand long and complex texts, and recognise finer shades of meaning, as well as attitudes and implicit opinions, as long as they have the opportunity to reread difficult passages and use reference books and search tools when necessary.
nn: Innlæraren kan forstå omfattande, komplekse tekstar og oppfatte finare nyansar, også haldningar og underforståtte meiningar, dersom ho/han har høve til å lese vanskelege passasjar om igjen og bruke oppslagsverk og søkeverktøy ved behov.

source: The objective of the training is for participants to be able to use simple phrases and sentences to talk about familiar topics related to themselves and their learning and work situations.
nn: Mål for opplæringa er at deltakaren skal kunne bruke enkle frasar og setningar for å snakke om kjende emne knytte til eige liv, opplæring og arbeid.

source: • understand most written information exchanges in private, public and
nn: • kan forstå det meste av skriftleg informasjonsutveksling i private, offentlege og

source: At levels B1 and B2, participants must also be able to handle more general topics.
nn: På nivå B1 og B2 skal deltakarane også kunne handtere meir allmenne tema.

source: the local dialect (e.g. personal pronouns);
nn: frekvente orda i den lokale dialekten (for eksempel personlege pronomen)

source: • convey the content of images and very simple spoken information;
nn: • formidle vidare innhaldet i bilete og svært enkel munnleg informasjon

source: At level A1, participants can understand and use familiar, everyday expressions and very simple phrases about themselves and topics they are familiar with.
nn: På nivå A1 kan deltakaren forstå og bruke kjende, daglegdagse uttrykk og svært enkle utsegner om seg sjølv og det kjende og nære.

source: • understand a wide range of popular science or academic articles and
nn: Innlæraren • kan forstå eit breitt spekter av allmennvitskaplege eller akademiske artiklar og

source: We sign up for courses we want to attend, and we pull out if we do not think that they are relevant enough.
nn: Me melder oss på kurs me ynskjer å gå på, og melder oss av igjen om me ikkje synest det er relevant nok.

source: When peers learn from and with each other, they can provide support and reflection, and challenge each other on the same level.
nn: Når jambyrdige lærer av og saman med kvarandre, kan dei gi støtte, reflektera og utfordra kvarandre på same nivå.

source: • present themselves and their competence, and answer questions in an
nn: • presentere seg sjølv og eigen kompetanse og svare på spørsmål i samband

source: • write in simple terms about themselves, such as where they live, what they
nn: • skrive svært enkelt om seg sjølv og nære forhold, slik som kvar ein bor, kva

source: • write clearly structured argumentative texts that are easy to read, and express
nn: • kan skrive argumenterande tekstar med ei oversiktleg og lesarvennleg
